tema6/Artillery/artillery_ejem10/ejem10.yml
config:
  environments:
    production:
      target: "wss://web-chat.herokuapp.com/chat"
      phases:
        - duration: 30
          arrivalRate: 15
    local:
      target: "ws://localhost:5000/chat"
      phases:
        - duration: 30
          arrivalRate: 15
  payload:
    - path: "users.csv"
      fields:
        - "user"
        - "room"
      order: "sequence"
scenarios:
  - engine: "ws"
    flow:
      - send: # LogIn
          name: "{{ user }}"
          chat: "{{ room }}"
      - think: 1
      - loop: # Send 100 messages
        - send: 
            message: "Hi everybody from {{ user }}"
            chat: "{{ room }}"
        - think: 1
        count: 100
      - think: 10 # Waiting for messages before close connection